TheTrueFlopsy/libavr/examples_atmega_u/nrf24x_test.c

#include <stddef.h>
#include <stdint.h>
#include <stdlib.h>
#include <avr/io.h>
#include <util/delay.h>

// NOTE: When "auto_watchdog.h" is included, the watchdog timer is automatically
//       disabled following an MCU reset.
#include "auto_watchdog.h"
#include "bitops.h"
#include "task_sched.h"
#include "std_tlv.h"
#include "spihelper.h"
#include "nrf24x.h"


// ---<<< Constant Definitions >>>---
#define FWID_L 0x04
#define FWID_H 0x01
#define FWVERSION 0x02

#define LED_DDR DDRD
#define LED_PORT PORTD
#define LED_PINR PIND

#define NRF_DDR_CE DDRC
#define NRF_PORT_CE PORTC
#define NRF_PINR_CE PINC

#define NRF_DDR_IRQ DDRD
#define NRF_PORT_IRQ PORTD
#define NRF_PINR_IRQ PIND

#define NRF_DDR_VCC DDRE
#define NRF_PORT_VCC PORTE
#define NRF_PINR_VCC PINE

// NOTE: On the Arduino Leonardo board, the hardware SS pin of the ATmegaU (PB0/SPI_SS)
//       is wired to the RXLED indicator, so a different pin (e.g. PB4/IO8) must
//       be used to drive the SPI slave select output line.
//#define NRF24X_TEST_SS_PIN SPI_SS
#define NRF24X_TEST_SS_PIN PORTB4

#define BAUD_RATE 38400
//#define BAUD_RATE 9600
#define USE_U2X 0

#define INM_ADDR 0x02

#define NRF24X_TEST_MAX_MSG_LEN 8

#define NOT_A_COMMAND 0b11110000

#define LED_BLINK_TASK_DELAY SCHED_TIME_MS(50)

#define LED_CTRL_TASK_DELAY SCHED_TIME_MS(10)
#define LED_CTRL_MAX_PAYLOAD 6
#define LED_CTRL_IDLE_DELAY SCHED_TIME_MS(2000)

enum {
	NRF24X_TASK_CAT    =  0,
	LED_BLINK_TASK_CAT =  1,
	LED_CTRL_TASK_CAT  =  2,
	MESSENGER_TASK_CAT =  3,
	TTLV_TASK_CAT      = 14
};

enum {
	TTLV_APP_MSG_T_OUT    = TTLV_MSG_T_APPLICATION + 0x00,
	TTLV_APP_MSG_T_IN     = TTLV_MSG_T_APPLICATION + 0x01,
	TTLV_APP_MSG_T_IN_RES = TTLV_MSG_T_APPLICATION + 0x02
};

enum {
	TTLV_APP_REG_STATUS     = TTLV_REG_APPLICATION + 0x00,
	TTLV_APP_REG_CMD_OUT_0  = TTLV_REG_APPLICATION + 0x01,
	TTLV_APP_REG_IOPINS     = TTLV_REG_APPLICATION + 0x02,  // CE and IRQ lines of the nRF24x chip
	TTLV_APP_REG_LED_CTRL   = TTLV_REG_APPLICATION + 0x03,  // LED control mode
	TTLV_APP_REG_LED_STEP   = TTLV_REG_APPLICATION + 0x04,  // LED control step
	TTLV_APP_REG_NRF24X     = TTLV_REG_APPLICATION + 0x20,
	TTLV_APP_REG_NRF24X_END = TTLV_APP_REG_NRF24X  + 0x20
};

enum {
	TTLV_APP_RES_BUSY     = TTLV_RES_APPLICATION + 0x00,
	TTLV_APP_RES_BFR_SIZE = TTLV_RES_APPLICATION + 0x01
};

#define N_LEDS 3

enum {
	LED_PIN0 = PORTD4,
	LED_PIN1 = PORTD0,
	LED_PIN2 = PORTD1
};

#define N_LED_STATES 4

enum {
	LED_STATE_OFF  = 0,
	LED_STATE_SLOW = 1,
	LED_STATE_FAST = 2,
	LED_STATE_ON   = 3
};

enum {
	LED_CTRL_MANUAL = 0,
	LED_CTRL_PTX    = 1,
	LED_CTRL_PRX    = 2
};

enum {
	LED_STEP_NONE         = 0,
	LED_STEP_STARTUP      = 1,
	LED_STEP_INIT_RETR    = 2,
	LED_STEP_INIT_DYNPD   = 3,
	LED_STEP_INIT_FEATURE = 4,
	LED_STEP_BEGIN        = 5,
	LED_STEP_UPDATE       = 6,
	LED_STEP_WAIT_POLL    = 7,
	LED_STEP_WAIT_POLLING = 8,
	LED_STEP_WAIT_FLUSH   = 9,
	LED_STEP_FETCH_LEN    = 10,
	LED_STEP_FETCH_DATA   = 11
};

static const uint8_t led_pins[N_LEDS] = {
	BV(LED_PIN0),
	BV(LED_PIN1),
	BV(LED_PIN2)
};

enum {
	NRF_PIN_CE  = PORTC6, // output
	NRF_PIN_IRQ = PIND7,  // input, active-low
	NRF_PIN_VCC = PORTE6  // output, active-low (if implemented with a PNP transistor)
};

enum {
	NRF_IN_OPT_NONE  = 0,
	NRF_IN_OPT_REG_R = BV(0)  // Send INM_REG_READ_RES response message.
};


// ---<<< Program State >>>---
static uint8_t led_states[N_LEDS] = { LED_STATE_OFF, LED_STATE_OFF, LED_STATE_OFF };
static uint8_t led_blink_counter = 0;

static uint8_t led_ctrl_mode = LED_CTRL_MANUAL;
static uint8_t led_ctrl_step = LED_STEP_NONE;
static uint8_t led_ctrl_reg_val;  // Register values fetched via SPI are stored here.
static uint8_t led_ctrl_payload_len;
static uint8_t led_ctrl_payload[LED_CTRL_MAX_PAYLOAD];

// ISSUE: Think about how to prevent wasteful buffer allocation and copying
//        just to avoid accessing volatile data as non-volatile (which apparently
//        causes undefined behavior, at least in principle). Would it work to
//        declare all library buffers non-volatile and then access them via
//        pointers to volatile when necessary?
static uint8_t pending_nrf_out_len = 0;
static uint8_t pending_nrf_out_bfr[NRF24X_BFR_SIZE];

static uint8_t pending_nrf_in_options = NRF_IN_OPT_NONE;
static uint8_t pending_nrf_in_cmd = NOT_A_COMMAND;
static uint8_t pending_nrf_in_len;
static uint16_t pending_nrf_in_request_id;
static uint8_t pending_nrf_in_srcadr;    // For INM return values.
static uint8_t *pending_nrf_in_bfr_ptr;  // For local return values.

#ifndef NRF24X_SYNCHRONOUS
static uint8_t active_nrf_out_len = 0;

static uint8_t active_nrf_in_options = NRF_IN_OPT_NONE;
static uint8_t active_nrf_in_cmd = NOT_A_COMMAND;
static uint8_t active_nrf_in_len;
static uint16_t active_nrf_in_request_id;
static uint8_t active_nrf_in_srcadr;
static uint8_t *active_nrf_in_bfr_ptr;
static uint8_t active_nrf_in_bfr[NRF24X_BFR_SIZE];
#endif

static union {
	uint8_t b[NRF24X_TEST_MAX_MSG_LEN];
	ttlv_msg_inm_reg r;
	ttlv_msg_inm_regpair rp;
} msg_data_out;

static union {
	uint8_t b[NRF24X_TEST_MAX_MSG_LEN];
	ttlv_msg_reg r;
} msg_data_in;


// ---<<< Pre-Declaration of LED Task Sub-Handlers >>>---
// --- Manual Mode / Common Steps ---
static void led_handler_manual(sched_task *task);

static void led_handler_reset(sched_task *task);

static void led_handler_startup(sched_task *task);

static void led_handler_init(sched_task *task);

// --- PTX Mode ---
static void led_handler_ptx_begin(sched_task *task);

static void led_handler_ptx_update(sched_task *task);

static void led_handler_ptx_wait(sched_task *task);

static void led_handler_ptx_fetch(sched_task *task);

// --- PRX Mode ---
static void led_handler_prx_begin(sched_task *task);

static void led_handler_prx_wait(sched_task *task);

static void led_handler_prx_fetch(sched_task *task);

static void led_handler_prx_request(sched_task *task);


// ---<<< Helper Functions >>>---
static ttlv_result set_led_state(uint8_t led_num, uint8_t led_state) {
	switch (led_state) {
	case LED_STATE_ON:  // LED fully on
		LED_PORT |= led_pins[led_num];
		break;
	case LED_STATE_SLOW:  // blink LED slowly
	case LED_STATE_FAST:  // blink LED quickly
		break;
	case LED_STATE_OFF: // LED fully off
		LED_PORT &= ~led_pins[led_num];
		break;
	default:
		return TTLV_RES_VALUE;  // Unrecognized LED state.
	}
	
	led_states[led_num] = led_state;
	return TTLV_RES_OK;
}

static uint8_t get_led_flags(void) {
	uint8_t led_flags = 0;
	
	for (uint8_t i = 0; i < N_LEDS; i++)
		if (led_states[i] == LED_STATE_ON)
			led_flags |= BV(i);
	
	return led_flags;
}

static void set_led_flags(uint8_t led_flags) {
	for (uint8_t i = 0; i < N_LEDS; i++) {
		set_led_state(i, (1 & led_flags) ? LED_STATE_ON : LED_STATE_OFF);
		led_flags >>= 1;
	}
}

