TheTrueFlopsy/libavr/examples_atmega_u/nrf24x_test.c
static void blink_leds(void) {
	uint8_t toggle_slow = (GET_BITFIELD(3, led_blink_counter) == 0);
	uint8_t toggle_fast = (GET_BITFIELD(1, led_blink_counter) == 0);
	led_blink_counter++;
	
	for (uint8_t i = 0; i < N_LEDS; i++) {
		if ((toggle_slow && led_states[i] == LED_STATE_SLOW) ||
		    (toggle_fast && led_states[i] == LED_STATE_FAST))
		{
			LED_PINR = led_pins[i];  // Toggle LED pin.
		}
	}
}

static ttlv_result set_led_ctrl_mode(uint8_t mode) {
	if (mode != LED_CTRL_MANUAL && mode != LED_CTRL_PTX && mode != LED_CTRL_PRX)
		return TTLV_RES_VALUE;  // Unrecognized LED control mode.
	
	if (mode != led_ctrl_mode) {
		sched_task *led_ctrl_task = sched_find(
			TASK_ST_NUM_CAT_MASK, TASK_ST_MAKE(0, LED_CTRL_TASK_CAT, 0), 0);
		
		if (led_ctrl_task == NULL)
			return TTLV_RES_INTERNAL;
		
		// Turn off power to the nRF24x module and then reinitialize it.
		led_ctrl_task->delay = SCHED_TIME_ZERO;
		led_ctrl_task->handler = led_handler_reset;
		led_ctrl_mode = mode;
	}
	
	return TTLV_RES_OK;
}

// NOTE: Output data must be pre-loaded into pending_nrf_out_bfr.
static void enqueue_nrf_out(uint8_t len) {
	pending_nrf_out_len = len;
	sched_task_tcww |= SCHED_CATFLAG(NRF24X_TASK_CAT);  // Awaken nRF24x control task.
}

static void enqueue_nrf_w_reg(uint8_t reg, uint8_t val) {
	pending_nrf_out_bfr[0] = NRF24X_W_REG_CMD(reg);
	pending_nrf_out_bfr[1] = val;
	enqueue_nrf_out(2);
}

static uint8_t enqueue_nrf_in(
	uint8_t opt, uint8_t cmd, uint8_t len, uint16_t req_id, uint8_t srcadr, uint8_t *bfr_ptr)
{
	if (pending_nrf_in_cmd != NOT_A_COMMAND)
		return 0;
	
	pending_nrf_in_options = opt;
	pending_nrf_in_cmd = cmd;
	pending_nrf_in_len = len;
	pending_nrf_in_request_id = req_id;
	pending_nrf_in_srcadr = srcadr;
	pending_nrf_in_bfr_ptr = bfr_ptr;
	
	sched_task_tcww |= SCHED_CATFLAG(NRF24X_TASK_CAT);  // Awaken nRF24x control task.
	return 1;
}

static ttlv_result ttlv_reg_read(ttlv_reg_index index, ttlv_reg_value *value_p) {
	// NOTE: This is sufficient for the R_REGISTER command, except the 5-byte address registers.
	if (index >= TTLV_APP_REG_NRF24X && index < TTLV_APP_REG_NRF24X_END) {
		if (enqueue_nrf_in(  // Attempt to enqueue nRF24x input operation.
			NRF_IN_OPT_REG_R, NRF24X_R_REG_CMD(index), 1,
			ttlv_recv_inm_header.h.msg_id, ttlv_recv_inm_header.h.srcadr, NULL))
		{
			return TTLV_RES_NONE;  // Suppress immediate INM response.
		}
		else  // Input operation already pending.
			return TTLV_APP_RES_BUSY;
	}
	
	switch (index) {
	case TTLV_REG_DEBUG0:  // LED blinker states as bits (1 if ON, otherwise 0)
		*value_p = get_led_flags();
		break;
	case TTLV_REG_DEBUG1:  // LED blinker state 0
		*value_p = led_states[0];
		break;
	case TTLV_REG_DEBUG2:  // LED blinker state 1
		*value_p = led_states[1];
		break;
	case TTLV_REG_DEBUG3:  // LED blinker state 2
		*value_p = led_states[2];
		break;
	case TTLV_REG_FWID_L:
		*value_p = FWID_L;
		break;
	case TTLV_REG_FWID_H:
		*value_p = FWID_H;
		break;
	case TTLV_REG_FWVERSION:
		*value_p = FWVERSION;
		break;
	case TTLV_APP_REG_STATUS:  // nRF24x status register
		*value_p = nrf24x_status;
		break;
	case TTLV_APP_REG_IOPINS:  // Get logic states of CE and IRQ pins.
		*value_p = GET_BITFIELD_AT(1, NRF_PIN_CE, NRF_PINR_CE) |
               (GET_BITFIELD_AT(1, NRF_PIN_IRQ, NRF_PINR_IRQ) << 1) |
               (GET_BITFIELD_AT(2, NRF_PIN_VCC, NRF_PINR_VCC) << 2);
		break;
	case TTLV_APP_REG_LED_CTRL:
		*value_p = led_ctrl_mode;
		break;
	case TTLV_APP_REG_LED_STEP:
		*value_p = led_ctrl_step;
		break;
	default:
		return TTLV_RES_REGISTER;
	}
	
	return TTLV_RES_OK;
}

static ttlv_result ttlv_reg_write(ttlv_reg_index index, ttlv_reg_value value) {
	// NOTE: This is sufficient for the W_REGISTER command, except the 5-byte address registers.
	if (index >= TTLV_APP_REG_NRF24X && index < TTLV_APP_REG_NRF24X_END) {
		if (pending_nrf_out_len)
			return TTLV_APP_RES_BUSY;
		
		enqueue_nrf_w_reg(index, value);
		return TTLV_RES_OK;  // Send immediate INM response, finish write operation later.
	}
	
	switch (index) {
	case TTLV_REG_DEBUG0:  // LED blinker states as bits (1 sets ON, 0 sets OFF)
		set_led_flags(value);
		break;
	case TTLV_REG_DEBUG1:  // LED blinker state 0
		return set_led_state(0, value);
	case TTLV_REG_DEBUG2:  // LED blinker state 1
		return set_led_state(1, value);
	case TTLV_REG_DEBUG3:  // LED blinker state 2
		return set_led_state(2, value);
	case TTLV_APP_REG_CMD_OUT_0:  // Enqueue nRF24x command without data bytes.
		// NOTE: This is sufficient for the FLUSH_TX, FLUSH_RX, REUSE_TX_PL and NOP commands.
		if (pending_nrf_out_len)
			return TTLV_APP_RES_BUSY;
		
		pending_nrf_out_bfr[0] = value;
		enqueue_nrf_out(1);  // Enqueue nRF24x output operation.
		break;
	case TTLV_APP_REG_IOPINS:  // Set logic state of CE and Vcc pins.
		NRF_PORT_CE = SET_BITFIELD_AT(1, NRF_PIN_CE, NRF_PORT_CE, value);
		NRF_PORT_VCC = SET_BITFIELD_AT(1, NRF_PIN_VCC, NRF_PORT_VCC, value >> 2);
		break;
	case TTLV_APP_REG_LED_CTRL:
		return set_led_ctrl_mode(value);
	default:
		return TTLV_RES_REGISTER;
	}
	
	return TTLV_RES_OK;
}

TTLV_STD_REG_TOGGLE(ttlv_reg_read, ttlv_reg_write, ttlv_reg_toggle)

TTLV_STD_REG_RW_EXCH(ttlv_reg_read, ttlv_reg_write, ttlv_reg_rw_exch)

TTLV_STD_REG_WR_EXCH(ttlv_reg_read, ttlv_reg_write, ttlv_reg_wr_exch)

TTLV_STD_REGPAIR_READ(ttlv_reg_read, ttlv_regpair_read)


// ---<<< Task Handlers >>>---
static void nrf24x_handler(sched_task *task) {
	uint8_t res;
	
#ifndef NRF24X_SYNCHRONOUS
	if (SPI_IS_ACTIVE) {  // SPI interface is busy, unable to proceed.
		task->st |= TASK_ST_SLP(1);  // Set sleep flag.
		return;
	}
	else if (active_nrf_out_len) {
		SPI_PORT |= BV(NRF24X_TEST_SS_PIN);  // Drive slave select pin high.
		active_nrf_out_len = 0;  // Done.
	}
	else if (active_nrf_in_cmd != NOT_A_COMMAND) {
		uint8_t *nrf_in_bfr = (active_nrf_in_bfr_ptr) ? active_nrf_in_bfr_ptr : active_nrf_in_bfr;
		
		SPI_PORT |= BV(NRF24X_TEST_SS_PIN);  // Drive slave select pin high.
		nrf24x_in_finish(nrf_in_bfr);  // Fetch input command data.
		
		// Send INM response if requested.
		if (active_nrf_in_srcadr == TTLV_LOCAL_ADR)  // Do not send an INM response.
			;  // Do nothing.
		else if (NRF_IN_OPT_REG_R & active_nrf_in_options) {
			msg_data_out.r.index = TTLV_APP_REG_NRF24X + NRF24X_REG_ADDR(active_nrf_in_cmd);
			msg_data_out.r.value = nrf_in_bfr[0];
			msg_data_out.r.request_id = active_nrf_in_request_id;
			
