TheTrueFlopsy/libavr/examples_atmega_u/nrf24x_test.c
			ttlv_xmit(active_nrf_in_srcadr,
				TTLV_MSG_T_INM_REG_READ_RES, TTLV_MSG_L_INM_REG_READ_RES, msg_data_out.b);
		}
		else {
			ttlv_xmit(active_nrf_in_srcadr,
				TTLV_APP_MSG_T_IN_RES, active_nrf_in_len, nrf_in_bfr);
		}
		
		active_nrf_in_cmd = NOT_A_COMMAND;  // Done.
	}
#endif
	
	// NOTE: Process pending output operation before input operation to make REG_WR_EXCH work properly.
	if (pending_nrf_out_len) {
		SPI_PORT &= ~BV(NRF24X_TEST_SS_PIN);  // Drive slave select pin low.
		
		switch (pending_nrf_out_len) {
		case 1:
			res = nrf24x_out_0(pending_nrf_out_bfr[0]);
			break;
		case 2:
			res = nrf24x_out_1(pending_nrf_out_bfr[0], pending_nrf_out_bfr[1]);
			break;
		default:
			res = nrf24x_out_n(pending_nrf_out_bfr[0], pending_nrf_out_len-1, pending_nrf_out_bfr+1);
			break;
		}
		
		if (res) {  // Success!
#ifdef NRF24X_SYNCHRONOUS
			SPI_PORT |= BV(NRF24X_TEST_SS_PIN);  // Done. Drive slave select pin high.
#else
			active_nrf_out_len = pending_nrf_out_len;  // Wait for asynchronous SPI operation.
			task->st |= TASK_ST_SLP(1);  // Set sleep flag.
#endif
		}
		else {  // ERROR
			SPI_PORT |= BV(NRF24X_TEST_SS_PIN);  // Command canceled. Drive slave select pin high.
		}
		
		pending_nrf_out_len = 0;  // Output command finished, initiated or canceled.
		return;  // Either wait for async operation or avoid dallying too long in the handler.
	}
	
	if (pending_nrf_in_cmd != NOT_A_COMMAND) {
#ifdef NRF24X_SYNCHRONOUS
		uint8_t active_nrf_in_bfr[NRF24X_BFR_SIZE];
#endif
		
		uint8_t *nrf_in_bfr = (pending_nrf_in_bfr_ptr) ? pending_nrf_in_bfr_ptr : active_nrf_in_bfr;
		
		SPI_PORT &= ~BV(NRF24X_TEST_SS_PIN);  // Drive slave select pin low.
		
		if (pending_nrf_in_len == 1)
			res = nrf24x_in_1(pending_nrf_in_cmd, nrf_in_bfr);
		else
			res = nrf24x_in_n(pending_nrf_in_cmd, pending_nrf_in_len, nrf_in_bfr);
		
		if (res) {  // Success!
#ifdef NRF24X_SYNCHRONOUS
			SPI_PORT |= BV(NRF24X_TEST_SS_PIN);  // Done. Drive slave select pin high.
			
			// Send INM response if requested.
			if (pending_nrf_in_srcadr == TTLV_LOCAL_ADR)  // Do not send an INM response.
				;  // Do nothing.
			else if (NRF_IN_OPT_REG_R & pending_nrf_in_options) {
				msg_data_out.r.index = TTLV_APP_REG_NRF24X + NRF24X_REG_ADDR(pending_nrf_in_cmd);
				msg_data_out.r.value = nrf_in_bfr[0];
				msg_data_out.r.request_id = pending_nrf_in_request_id;
				
				ttlv_xmit(pending_nrf_in_srcadr,
					TTLV_MSG_T_INM_REG_READ_RES, TTLV_MSG_L_INM_REG_READ_RES, msg_data_out.b);
			}
			else {
				ttlv_xmit(pending_nrf_in_srcadr,
					TTLV_APP_MSG_T_IN_RES, pending_nrf_in_len, nrf_in_bfr);
			}
#else
			active_nrf_in_options = pending_nrf_in_options;
			active_nrf_in_cmd = pending_nrf_in_cmd;  // Wait for asynchronous SPI operation.
			active_nrf_in_len = pending_nrf_in_len;
			active_nrf_in_request_id = pending_nrf_in_request_id;
			active_nrf_in_srcadr = pending_nrf_in_srcadr;
			active_nrf_in_bfr_ptr = pending_nrf_in_bfr_ptr;
			task->st |= TASK_ST_SLP(1);  // Set sleep flag.
#endif
		}
		else {  // ERROR
			SPI_PORT |= BV(NRF24X_TEST_SS_PIN);  // Command canceled. Drive slave select pin high.
		}
		
		pending_nrf_in_cmd = NOT_A_COMMAND;  // Input command finished, initiated or canceled.
		return;  // Either wait for async operation or avoid dallying too long in the handler.
	}
	
	task->st |= TASK_ST_SLP(1);  // No work to do. Set sleep flag.
}

static void led_blink_handler(sched_task *task) {
	blink_leds();
	task->delay = LED_BLINK_TASK_DELAY;
}

// --- Manual Mode / Common Steps---
static void led_handler_manual(sched_task *task) {
	task->delay = LED_CTRL_TASK_DELAY;
}

static void led_handler_reset(sched_task *task) {
	led_ctrl_step = LED_STEP_NONE;
	task->delay = LED_CTRL_TASK_DELAY;
	
	if (pending_nrf_out_len)  // Check whether there is a pending nRF24x output operation.
		return;  // In that case, wait.
	
#ifndef NRF24X_SYNCHRONOUS
	if (active_nrf_out_len)  // Check whether there is an active nRF24x output operation.
		return;  // In that case, also wait.
#endif
	
	NRF_PORT_CE &= ~BV(NRF_PIN_CE);  // Set the CE pin low.
	
	task->delay = SCHED_TIME_MS(500);  // Too short for power cycling?
	
	if (led_ctrl_mode == LED_CTRL_PTX || led_ctrl_mode == LED_CTRL_PRX)
		task->handler = led_handler_startup;
	else
		task->handler = led_handler_manual;
	
	NRF_PORT_VCC |= BV(NRF_PIN_VCC);  // Disable power supply to nRF24x module.
}

static void led_handler_startup(sched_task *task) {
	led_ctrl_step = LED_STEP_STARTUP;
	task->delay = SCHED_TIME_MS(200);  // nRF24x startup delay (with some margin)
	task->handler = led_handler_init;
	
	NRF_PORT_VCC &= ~BV(NRF_PIN_VCC);  // Enable power supply to nRF24x module.
}

static void led_handler_init(sched_task *task) {
	task->delay = LED_CTRL_TASK_DELAY;
	
	if (pending_nrf_out_len)  // Check whether there is a pending nRF24x output operation.
		return;  // In that case, wait.
	
	switch (led_ctrl_step) {
	case LED_STEP_INIT_RETR:
		// Write to the DYNPD register.
		led_ctrl_step = LED_STEP_INIT_DYNPD;
		enqueue_nrf_w_reg(NRF24X_DYNPD, BV(NRF24X_P0));
		break;
	case LED_STEP_INIT_DYNPD:
		// Write to the FEATURE register.
		led_ctrl_step = LED_STEP_INIT_FEATURE;
		enqueue_nrf_w_reg(NRF24X_FEATURE, BV(NRF24X_EN_DPL) | BV(NRF24X_EN_ACK_PAY));
		break;
	case LED_STEP_INIT_FEATURE:  // Initialization done.
		switch (led_ctrl_mode) {
		case LED_CTRL_PTX:
			task->handler = led_handler_ptx_begin;
			break;
		case LED_CTRL_PRX:
			task->handler = led_handler_prx_begin;
			break;
		default:  // Something has gone wrong.
			task->handler = led_handler_reset;
			break;
		}
		break;
	default:  // Beginning initialization.
		// Write to the SETUP_RETR register.
		led_ctrl_step = LED_STEP_INIT_RETR;
		enqueue_nrf_w_reg(NRF24X_SETUP_RETR, NRF24X_SETUP_RETR_VAL(1, 3));
		break;
	}
}

// --- PTX Mode ---
static void led_handler_ptx_begin(sched_task *task) {
	task->delay = LED_CTRL_TASK_DELAY;
	
	if (pending_nrf_out_len)  // Check whether there is a pending nRF24x output operation.
		return;  // In that case, wait.
	
