TheTrueFlopsy/libavr/examples_atmega_u/nrf24x_test.c
	if (led_ctrl_step == LED_STEP_BEGIN) {
		srandom(SCHED_TIME_TO_TICKS(sched_ticks)); // Initialize PRNG.
		
		task->handler = led_handler_ptx_update;  // Chip activation done.
	}
	else {  // Activate the chip as PTX.
		led_ctrl_step = LED_STEP_BEGIN;
		enqueue_nrf_w_reg(NRF24X_CONFIG, BV(NRF24X_EN_CRC) | BV(NRF24X_PWR_UP));
	}
}

static void led_handler_ptx_update(sched_task *task) {
	task->delay = LED_CTRL_TASK_DELAY;
	
	if (pending_nrf_out_len)  // Check whether there is a pending nRF24x output operation.
		return;  // In that case, wait.
	
	if (led_ctrl_step == LED_STEP_UPDATE) {  // LED state update initiated.
#ifndef NRF24X_SYNCHRONOUS
		if (active_nrf_out_len)  // Check whether there is an active nRF24x output operation.
			return;  // In that case, wait. (Never set CE high before all SPI ops have finished.)
#endif
		
		// Drive the CE pin high for more than 10 μs to trigger transmission.
		NRF_PORT_CE |= BV(NRF_PIN_CE);
		_delay_us(50.0);
		NRF_PORT_CE &= ~BV(NRF_PIN_CE);
		
		task->handler = led_handler_ptx_wait;  // Wait for response.
	}
	else {  // Begin LED state update.
		led_ctrl_step = LED_STEP_UPDATE;
		
		// Update local LED states (arbitrarily chosen state change).
		uint32_t r = (uint32_t)random();
		uint8_t led_num = (uint8_t)(r >> 8) % N_LEDS;
		uint8_t led_state = (uint8_t)r % N_LED_STATES;
		set_led_state(led_num, led_state);
		
		// Submit a LED state update message for transmission with the W_TX_PAYLOAD command.
		pending_nrf_out_bfr[0] = NRF24X_W_TX_PAYLOAD;
		pending_nrf_out_bfr[1] = led_num;
		pending_nrf_out_bfr[2] = led_state;
		enqueue_nrf_out(3);
		
		// TODO: If a LED state change has been requested by the PRX, then submit an extended
		// state update message (6 bytes: 3 × (LED index, state code)).
		// TODO: Also submit an extended update message if the previous state update transmission
		// failed (since the PRX is now at least two updates out of synch with the PTX).
	}
}

static void led_handler_ptx_wait(sched_task *task) {
	task->delay = LED_CTRL_TASK_DELAY;
	
	if (led_ctrl_step == LED_STEP_WAIT_POLLING) {  // STATUS polling in progress.
		if (pending_nrf_out_len)  // Check whether there is a pending nRF24x output operation.
			return;  // In that case, wait.
		
#ifndef NRF24X_SYNCHRONOUS
		if (active_nrf_out_len)  // Check whether there is an active nRF24x output operation.
			return;  // In that case, also wait.
#endif
		
		uint8_t status = led_ctrl_reg_val;  // Get STATUS value.
		
		// ISSUE: Use a timeout as a fallback if we never see one of the expected interrupts?
		if (BV(NRF24X_TX_DS) & status) {  // Transmission successful!
			if (BV(NRF24X_RX_DR) & status) {  // Acknowledgement payload received.
				task->handler = led_handler_ptx_fetch;  // Fetch the received payload.
				enqueue_nrf_w_reg(NRF24X_STATUS, BV(NRF24X_TX_DS) | BV(NRF24X_RX_DR));  // Clear interrupt flags.
			}
			else {
				task->delay = LED_CTRL_IDLE_DELAY;  // Idle until next LED state update.
				task->handler = led_handler_ptx_update;
				enqueue_nrf_w_reg(NRF24X_STATUS, BV(NRF24X_TX_DS));  // Clear interrupt flag.
			}
		}
		else if (BV(NRF24X_MAX_RT) & status) {  // Transmission failed.
			led_ctrl_step = LED_STEP_WAIT_FLUSH;
			enqueue_nrf_w_reg(NRF24X_STATUS, BV(NRF24X_MAX_RT));  // Clear interrupt flag.
		}
		else  // Transmission still ongoing?
			led_ctrl_step = LED_STEP_WAIT_POLL;
	}
	else if (led_ctrl_step == LED_STEP_WAIT_FLUSH) {
		task->delay = LED_CTRL_IDLE_DELAY;  // Idle until next LED state update.
		task->handler = led_handler_ptx_update;  // Try again later.
		
		// Unacknowledged payloads remain in the TX FIFO, which must be flushed to remove the payload.
		pending_nrf_out_bfr[0] = NRF24X_FLUSH_TX;
		enqueue_nrf_out(1);
	}
	else if (BV(NRF_PIN_IRQ) & NRF_PINR_IRQ)  // Don't bother with polling until the IRQ pin goes low.
		led_ctrl_step = LED_STEP_WAIT_POLL;  // Do nothing more at this time.
	else if (enqueue_nrf_in(  // Attempt to poll the STATUS register.
		NRF_IN_OPT_NONE, NRF24X_R_REG_CMD(NRF24X_STATUS), 1, 0, TTLV_LOCAL_ADR, &led_ctrl_reg_val))
	{
		led_ctrl_step = LED_STEP_WAIT_POLLING;
	}
}

static void led_handler_ptx_fetch(sched_task *task) {
	task->delay = LED_CTRL_TASK_DELAY;
	
	if (pending_nrf_out_len)  // Check whether there is a pending nRF24x output operation.
		return;  // In that case, wait.
	
	switch (led_ctrl_step) {
		uint8_t payload_len;
		
	case LED_STEP_FETCH_LEN:
#ifndef NRF24X_SYNCHRONOUS
		if (active_nrf_out_len)  // Check whether there is an active nRF24x output operation.
			return;  // In that case, also wait.
#endif
		
		payload_len = led_ctrl_reg_val;  // Get payload length received from chip.
		
		if (payload_len > sizeof(led_ctrl_payload)) {  // Payload too large.
			task->delay = LED_CTRL_IDLE_DELAY;  // Idle until next LED state update.
			task->handler = led_handler_ptx_update;
			
			pending_nrf_out_bfr[0] = NRF24X_FLUSH_RX;  // Flush the RX FIFO.
			enqueue_nrf_out(1);
		}
		else {
			led_ctrl_step = LED_STEP_FETCH_DATA;
			led_ctrl_payload_len = payload_len;
			
			enqueue_nrf_in(  // Get the message payload.
				NRF_IN_OPT_NONE, NRF24X_R_RX_PAYLOAD, payload_len, 0, TTLV_LOCAL_ADR, led_ctrl_payload);
		}
		break;
	case LED_STEP_FETCH_DATA:
#ifndef NRF24X_SYNCHRONOUS
		if (active_nrf_out_len)  // Check whether there is an active nRF24x output operation.
			return;  // In that case, also wait.
#endif
		
		// TODO: Parse the received payload and update LED states accordingly.
		
		task->delay = LED_CTRL_IDLE_DELAY;  // Idle until next LED state update.
		task->handler = led_handler_ptx_update;
		break;
	default:  // Beginning acknowledgement payload fetch.
		led_ctrl_step = LED_STEP_FETCH_LEN;
		
		enqueue_nrf_in(  // Get the message payload length.
			NRF_IN_OPT_NONE, NRF24X_R_RX_PL_WID, 1, 0, TTLV_LOCAL_ADR, &led_ctrl_reg_val);
		break;
	}
}

// --- PRX Mode ---
static void led_handler_prx_begin(sched_task *task) {
	task->delay = LED_CTRL_TASK_DELAY;
	
	if (pending_nrf_out_len)  // Check whether there is a pending nRF24x output operation.
		return;  // In that case, wait.
	
