TheTrueFlopsy/libavr/examples_atmega_u/nrf24x_test.c
	if (led_ctrl_step == LED_STEP_BEGIN) {
#ifndef NRF24X_SYNCHRONOUS
		if (active_nrf_out_len)  // Check whether there is an active nRF24x output operation.
			return;  // In that case, also wait.
#endif
		
		// Set the CE pin high to enter the RX Mode state.
		_delay_us(50.0);  // Wait an extra little while just to be safe.
		NRF_PORT_CE |= BV(NRF_PIN_CE);
		
		task->handler = led_handler_prx_wait;  // Chip activation done.
	}
	else {  // Activate the chip as PRX.
		led_ctrl_step = LED_STEP_BEGIN;
		enqueue_nrf_w_reg(NRF24X_CONFIG, BV(NRF24X_EN_CRC) | BV(NRF24X_PWR_UP) | BV(NRF24X_PRIM_RX));
	}
}

static void led_handler_prx_wait(sched_task *task) {
	task->delay = LED_CTRL_TASK_DELAY;
	
	if (led_ctrl_step == LED_STEP_WAIT_POLLING) {  // STATUS polling in progress.
		if (pending_nrf_out_len)  // Check whether there is a pending nRF24x output operation.
			return;  // In that case, wait.
		
#ifndef NRF24X_SYNCHRONOUS
		if (active_nrf_out_len)  // Check whether there is an active nRF24x output operation.
			return;  // In that case, also wait.
#endif
		
		uint8_t status = led_ctrl_reg_val;  // Get STATUS value.
		
		if (BV(NRF24X_RX_DR) & status) {  // Packet received!
			task->handler = led_handler_prx_fetch;  // Fetch the received payload.
			enqueue_nrf_w_reg(NRF24X_STATUS, BV(NRF24X_TX_DS) | BV(NRF24X_RX_DR));  // Clear interrupt flags.
		}
		else  // Keep waiting.
			led_ctrl_step = LED_STEP_WAIT_POLL;
	}
	else if (BV(NRF_PIN_IRQ) & NRF_PINR_IRQ)  // Don't bother with polling until the IRQ pin goes low.
		led_ctrl_step = LED_STEP_WAIT_POLL;  // Do nothing more at this time.
	else if (enqueue_nrf_in(  // Attempt to poll the STATUS register.
		NRF_IN_OPT_NONE, NRF24X_R_REG_CMD(NRF24X_STATUS), 1, 0, TTLV_LOCAL_ADR, &led_ctrl_reg_val))
	{
		led_ctrl_step = LED_STEP_WAIT_POLLING;
	}
}

static void led_handler_prx_fetch(sched_task *task) {
	task->delay = LED_CTRL_TASK_DELAY;
	
	if (pending_nrf_out_len)  // Check whether there is a pending nRF24x output operation.
		return;  // In that case, wait.
	
	switch (led_ctrl_step) {
		uint8_t payload_len;
		
	case LED_STEP_FETCH_LEN:
#ifndef NRF24X_SYNCHRONOUS
		if (active_nrf_out_len)  // Check whether there is an active nRF24x output operation.
			return;  // In that case, also wait.
#endif
		
		payload_len = led_ctrl_reg_val;  // Get payload length received from chip.
		
		if (payload_len > sizeof(led_ctrl_payload)) {  // Payload too large.
			task->handler = led_handler_prx_wait;  // Resume waiting for packages.
			
			pending_nrf_out_bfr[0] = NRF24X_FLUSH_RX;  // Flush the RX FIFO.
			enqueue_nrf_out(1);
		}
		else {
			led_ctrl_step = LED_STEP_FETCH_DATA;
			led_ctrl_payload_len = payload_len;
			
			enqueue_nrf_in(  // Get the message payload.
				NRF_IN_OPT_NONE, NRF24X_R_RX_PAYLOAD, payload_len, 0, TTLV_LOCAL_ADR, led_ctrl_payload);
		}
		break;
	case LED_STEP_FETCH_DATA:
#ifndef NRF24X_SYNCHRONOUS
		if (active_nrf_out_len)  // Check whether there is an active nRF24x output operation.
			return;  // In that case, also wait.
#endif
		
		// Parse the received payload and update LED states accordingly.
		payload_len = led_ctrl_payload_len;
		
		for (uint8_t i = 0; i < payload_len; i += 2) {
			uint8_t led_num = led_ctrl_payload[i];
			uint8_t led_state = led_ctrl_payload[i+1];
			
			if (led_num < N_LEDS)
				set_led_state(led_num, led_state);
		}
		
		// TODO: Consider submitting a LED state change request for transmission with the next
		// acknowledgement message.
		
		task->handler = led_handler_prx_wait;  // Resume waiting for packages.
		break;
	default:  // Beginning payload fetch.
		led_ctrl_step = LED_STEP_FETCH_LEN;
		
		enqueue_nrf_in(  // Get the message payload length.
			NRF_IN_OPT_NONE, NRF24X_R_RX_PL_WID, 1, 0, TTLV_LOCAL_ADR, &led_ctrl_reg_val);
		break;
	}
}

static void led_handler_prx_request(sched_task *task) {
	// TODO: Implement this.
}

static void message_handler(sched_task *task) {
	ttlv_result res = TTLV_RES_NONE;
	
	if (!TTLV_HAS_MESSAGE) {
		task->st |= TASK_SLEEP_BIT;  // Set sleep flag.
		return;
	}
	
	if (TTLV_CHECK_REG_READ) {
		ttlv_recv(msg_data_in.b);
		
		msg_data_out.r.index = msg_data_in.b[0];
		msg_data_out.r.request_id = ttlv_recv_inm_header.h.msg_id;
		
		res = ttlv_reg_read(msg_data_out.r.index, &msg_data_out.r.value);
		
		if (res == TTLV_RES_OK) {
			ttlv_xmit_response(TTLV_MSG_T_INM_REG_READ_RES, TTLV_MSG_L_INM_REG_READ_RES, msg_data_out.b);
			res = TTLV_RES_NONE;
		}
	}
	else if (TTLV_CHECK_REG_WRITE) {
		ttlv_recv(msg_data_in.b);
		
		res = ttlv_reg_write(msg_data_in.r.index, msg_data_in.r.value);
	}
	else if (TTLV_CHECK_REG_TOGGLE) {
		ttlv_recv(msg_data_in.b);
		
		if (msg_data_in.r.index >= TTLV_APP_REG_NRF24X && msg_data_in.r.index < TTLV_APP_REG_NRF24X_END)
			res = TTLV_RES_REGISTER;  // Unsupported operation.
		else {
			msg_data_out.r.index = msg_data_in.r.index;
			msg_data_out.r.value = msg_data_in.r.value;
			msg_data_out.r.request_id = ttlv_recv_inm_header.h.msg_id;
			
			res = ttlv_reg_toggle(msg_data_out.r.index, &msg_data_out.r.value);
			
			if (res == TTLV_RES_OK) {
				ttlv_xmit_response(TTLV_MSG_T_INM_REG_READ_RES, TTLV_MSG_L_INM_REG_READ_RES, msg_data_out.b);
				res = TTLV_RES_NONE;
			}
		}
	}
	else if (TTLV_CHECK_REG_RW_EXCH) {
		ttlv_recv(msg_data_in.b);
		
		if (msg_data_in.r.index >= TTLV_APP_REG_NRF24X && msg_data_in.r.index < TTLV_APP_REG_NRF24X_END)
			res = TTLV_RES_REGISTER;  // Unsupported operation.
		else {
			msg_data_out.r.index = msg_data_in.r.index;
			msg_data_out.r.value = msg_data_in.r.value;
			msg_data_out.r.request_id = ttlv_recv_inm_header.h.msg_id;
			
			res = ttlv_reg_rw_exch(msg_data_out.r.index, &msg_data_out.r.value);
			
			if (res == TTLV_RES_OK) {
				ttlv_xmit_response(TTLV_MSG_T_INM_REG_READ_RES, TTLV_MSG_L_INM_REG_READ_RES, msg_data_out.b);
				res = TTLV_RES_NONE;
			}
		}
	}
	else if (TTLV_CHECK_REG_WR_EXCH) {
		ttlv_recv(msg_data_in.b);
		
		msg_data_out.r.index = msg_data_in.r.index;
		msg_data_out.r.value = msg_data_in.r.value;
		msg_data_out.r.request_id = ttlv_recv_inm_header.h.msg_id;
		
		res = ttlv_reg_wr_exch(msg_data_out.r.index, &msg_data_out.r.value);
		
		if (res == TTLV_RES_OK) {
			ttlv_xmit_response(TTLV_MSG_T_INM_REG_READ_RES, TTLV_MSG_L_INM_REG_READ_RES, msg_data_out.b);
			res = TTLV_RES_NONE;
		}
	}
	else if (TTLV_CHECK_REGPAIR_READ) {
		ttlv_recv(msg_data_in.b);
		
		msg_data_out.rp.index = msg_data_in.b[0];
		msg_data_out.rp.request_id = ttlv_recv_inm_header.h.msg_id;
		
		res = ttlv_regpair_read(msg_data_out.rp.index, &msg_data_out.rp.value);
		
		if (res == TTLV_RES_OK) {
			ttlv_xmit_response(TTLV_MSG_T_INM_REGPAIR_READ_RES, TTLV_MSG_L_INM_REGPAIR_READ_RES, msg_data_out.b);
			res = TTLV_RES_NONE;
		}
	}
	else if (TTLV_CHECK_TL_MAX(TTLV_APP_MSG_T_OUT, NRF24X_TEST_MAX_MSG_LEN)) {
		if (pending_nrf_out_len) {
			ttlv_finish_recv();
			res = TTLV_APP_RES_BUSY;
		}
		else {
			ttlv_recv(pending_nrf_out_bfr);
			enqueue_nrf_out(ttlv_recv_header.h.length);  // Enqueue nRF24x output operation.
			res = TTLV_RES_OK;
		}
	}
	else if (TTLV_CHECK_TL(TTLV_APP_MSG_T_IN, 2)) {
		if (pending_nrf_in_cmd != NOT_A_COMMAND) {
			ttlv_finish_recv();
			res = TTLV_APP_RES_BUSY;
		}
		else {
			ttlv_recv(msg_data_in.b);
			
			if (msg_data_in.b[1] >= NRF24X_BFR_SIZE)
				res = TTLV_APP_RES_BFR_SIZE;
			else {
				enqueue_nrf_in(  // Enqueue nRF24x input operation.
					NRF_IN_OPT_NONE, msg_data_in.b[0], msg_data_in.b[1],
					0, ttlv_recv_inm_header.h.srcadr, NULL);
			}
		}
	}
	else {  // Unrecognized message.
		// NOTE: Probably not a good idea to always send error messages in
		//       response to unrecognized messages. Doing so can easily
		//       trigger self-sustaining message cascades.
		ttlv_finish_recv();
	}
	
	if (res != TTLV_RES_NONE)
		ttlv_xmit_inm_result(res);
}


// ---<<< Initialization Routines and Main Function >>>---
static void init_tasks(void) {
	sched_task task;
	
	task = (sched_task) {
		.st = TASK_ST_MAKE(0, NRF24X_TASK_CAT, 0),
		.delay = SCHED_TIME_ZERO,
		.handler = nrf24x_handler
	};
	sched_add(&task);
	
	task = (sched_task) {
		.st = TASK_ST_MAKE(0, LED_BLINK_TASK_CAT, 0),
		.delay = LED_BLINK_TASK_DELAY,
		.handler = led_blink_handler
	};
	sched_add(&task);
	
	task = (sched_task) {
		.st = TASK_ST_MAKE(0, LED_CTRL_TASK_CAT, 0),
		.delay = LED_CTRL_TASK_DELAY,
		.handler = led_handler_manual
	};
	sched_add(&task);
	
	task = (sched_task) {
		.st = TASK_ST_MAKE(0, MESSENGER_TASK_CAT, 0),
		.delay = SCHED_TIME_ZERO,
		.handler = message_handler
	};
	sched_add(&task);
}

// NOTE: This is the entry point, tell compiler not to save/restore registers.
int main(void) __attribute__ ((OS_main));

int main(void) {
	// Set LED pins as outputs.
	LED_DDR |= BV(LED_PIN0) | BV(LED_PIN1) | BV(LED_PIN2);
	
	// Set nRF24x CE and Vcc control pins as outputs.
	NRF_PORT_VCC |= BV(NRF_PIN_VCC);  // Vcc control pin is active-low.
	NRF_DDR_CE |= BV(NRF_PIN_CE);
	NRF_DDR_VCC |= BV(NRF_PIN_VCC);
	
	sched_init();
	
	ttlv_init(
		TASK_ST_MAKE(0, TTLV_TASK_CAT, 0),
		BAUD_TO_UBRR(BAUD_RATE, USE_U2X), TTLV_PARITY_NONE, USE_U2X,
		TTLV_MODE_INM, 0, SCHED_CATFLAG(MESSENGER_TASK_CAT));
	ttlv_xmit_inm_header.h.srcadr = INM_ADDR;  // Set INM source address.
	
	// Run SPI module in Master mode, at clock frequency F_CPU/64 ~= 250kHz (at F_CPU=16 MHz).
	// Make the Slave mode slave select pin a Master mode slave select output.
#ifdef NRF24X_SYNCHRONOUS
	spihelper_mstr_init(BV(NRF24X_TEST_SS_PIN), 0, 0, BV(MSTR) | BV(SPR1));
#else
	spihelper_async_mstr_init(
		BV(NRF24X_TEST_SS_PIN), 0, 0, BV(MSTR) | BV(SPR1),
		SCHED_CATFLAG(NRF24X_TASK_CAT));
#endif
	
	init_tasks();
	
	sched_run();
	
	return 0;
}
